examples/twoD_tripleFlame/H2/torchSolver/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices #codeStream
{
    codeInclude
    #{
        #include "pointField.H"
    #};

    code
    #{
        pointField points(8);
        points[0]  = point(0, 0, -0.5);
        points[1]  = point(50, 0, -0.5);
        points[2]  = point(50, 11, -0.5);
        points[3]  = point(0, 11, -0.5);
        points[4]  = point(0, 19, -0.5);
        points[5]  = point(50, 19, -0.5);
        points[6]  = point(50, 30, -0.5);
        points[7]  = point(0, 30, -0.5);

        // Duplicate z points
        label sz = points.size();
        points.setSize(2*sz);
        for (label i = 0; i < sz; i++)
        {
            const point& pt = points[i];
            points[i+sz] = point(pt.x(), pt.y(), -pt.z());
        }

        os  << points;
    #};
};

blocks
(
    hex (0 1 2 3 8 9 10 11) (500 110 1) simpleGrading (1 1 1)
    hex (3 2 5 4 11 10 13 12) (500 80 1) simpleGrading (1 1 1)
    hex (4 5 6 7 12 13 14 15) (500 110 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fuelInlet
    {
        type patch;
        faces
        (
            (3 4 11 12)
        );
    }
    airInlet
    {
        type patch;
        faces
        (
            (0 3 8 11)
            (4 7 12 15)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            // (1 6 9 14)
            (1 2 9 10)
            (2 5 10 13)
            (5 6 13 14)
        );
    }
    up
    {
        type cyclic;
        neighbourPatch down;
        faces
        (
            (7 6 15 14)
        );
    }
    down
    {
        type cyclic;
        neighbourPatch up;
        faces
        (
            (0 1 8 9)
        );
    }
);

// mergePatchPairs
// (
// );

// ************************************************************************* //
