examples/twoD_tripleFlame/H2/torchSolver/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
150000
(
(2.7621 0 0)
(2.75816 0 0)
(2.75417 0 0)
(2.75013 0 0)
(2.74604 0 0)
(2.7419 0 0)
(2.73771 0 0)
(2.73347 0 0)
...
)
;

boundaryField
{
    fuelInlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
80
(
(3.01585 0 0)
(3.52833 0 0)
(3.79544 0 0)
(3.98233 0 0)
(4.1279 0 0)
(4.24795 0 0)
(4.35055 0 0)
(4.4404 0 0)
...
)
;
    }
    airInlet
    {
        type            fixedValue;
        value           uniform (3 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    up
    {
        type            cyclic;
    }
    down
    {
        type            cyclic;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
