examples/twoD_tripleFlame/H2/torchSolver/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.01325e+05;

boundaryField
{
    up
    {
        type            cyclic;
    }
    down
    {
        type            cyclic;
    }
    fuelInlet
    {
        type            zeroGradient;
    }
    airInlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            waveTransmissive;
        gamma            1.4;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
