examples/twoD_tripleFlame/H2/torchSolver/system/funkySetBoundaryDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetBoundaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

velocities {
    field U;
    expressions
    (
        {
            target value;
            patchName fuelInlet;
            expression "vector(5,0,0)*1.128*pow(mag(0.004-(mag(pos().y-0.015)))/0.004,1/7)";
        }
    );
}

// ************************************************************************* //
