examples/twoD_tripleFlame/H2/torchSolver/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
 (
U1  
    {
     field U; 
     expression "vector(3,0,0)*0.5*(1+erf(1-pos().x/0.016))"; 
     condition  "(pos().x>0) && (pos().y>=0.019) || (pos().y<=0.011)"; 
     keepPatches 1; 
    }
U2 
    {
     field U; 
     expression "vector(5,0,0)*1.128*pow(mag(0.004-(mag(pos().y-0.015)))/0.004,1/7)*0.5*(1+erf(1-pos().x/0.016))";
     condition  "(pos().x>0) && (pos().y<0.019) && (pos().y>0.011)"; 
     keepPatches 1; 
    }
h2_1
    {
     field H2;
     expression "0.176470588235294*0.5*(1+erf(1-pos().x/0.016))";
     condition  "(pos().x>0) && (pos().y<0.019) && (pos().y>0.011)";
     keepPatches 1; 
    }
h2_2
    {
     field H2;
     expression "0";
     condition  "(pos().x>0) && (pos().y>=0.019) || (pos().y<=0.011)";
     keepPatches 1; 
    }
n2_1
    {
     field N2;
     expression "0.766899766899767+0.5*(1+erf(1-pos().x/0.016))*(0.823529411764706-0.766899766899767)";
     condition  "(pos().x>0) && (pos().y<0.019) && (pos().y>0.011)";
     keepPatches 1; 
    }
n2_2
    {
     field N2;
     expression "0.766899766899767";
     condition  "(pos().x>0) && (pos().y>=0.019) || (pos().y<=0.011)";
     keepPatches 1; 
    }
o2_1
    {
     field O2;
     expression "0.5*0.233100233100233*(1-erf(1-pos().x/0.016))";
     condition  "(pos().x>0) && (pos().y<=0.019) && (pos().y>=0.011)";
     keepPatches 1;
    }
o2_2
    {
     field O2;
     expression "0.233100233100233";
     condition  "(pos().x>0) && (pos().y>0.019) || (pos().y<0.011)";
     keepPatches 1; 
    }
T1
    {
     field T;
     expression "1200";
     condition  "(mag(pos().y-0.015)<=0.004) && (pos().x>0.016) && (pos().x<0.02)";
     keepPatches 1; 
    }
 );


// ************************************************************************* //
